// wrote_241202 M.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    
}

// 기소서
// (하루에 2시간씩 2주간 쓴다.)
// 
// 사진은 무조건 용모단정하게
// 양복입은 사진으로
// (단 면접시 양복은 입지 않는다.)
// 
// ppt
// 규격이 모두 같게 (통일성)
// 웬만해서 어두운 배경으로 만들지 않기
// 유색배경 금지
// (프린트할 가능성...도 있음)
// 60페이지 이하
// 
// pdf로 만들어서 다운받는 형식으로 만들지 말자.
// 
// 내용
// 프로젝트형과 기술형으로 나뉜다.
// 영상링크를 거는 것이 일반적이므로
// 선생님의 추천은 프로젝트형.
// 소개페이지에 영상 링크를 거는게 일반적이다.
// 
// 기술형은 시스템에 대해 설명한다.
// (Astart, 충돌구조...)
// 
// 프로젝트형은 여태까지 한 프로젝트에 대해 설명한다.
// (API, 다렉, 언리얼...)
// 
// 
// 
// 
// 
// 
